cities = [("Москва", 13015126, 1147, 1),
          ("Париж", 2148327, 300, 2),
          ("Берлин", 3664088, 1237, 3),
          ("Пекин", 21839095, 473, 4),
          ("Нью-Дели", 3431336, 1911, 5),
          ("Мумбаи", 1541428, 1507, 5),
          ("Бангалор", 8443675, 1537, 5),
          ("Ченнаи", 9100000, 1639, 5),
          ("Калькутта", 4486679, 1690, 5),
          ("Санкт-Петербург", 5607916, 1703, 1),
          ("Новосибирск", 1633595, 1893, 1),
          ("Екатеринбург", 1544376, 1723, 1),
          ("Нижний Новгород", 1249861, 1221, 1),
          ("Марсель", 870018, 600, 2),
          ("Лион", 506615, 43, 2),
          ("Тулуза", 475438, 106, 2),
          ("Ницца", 533554, 156, 2),
          ("Гамбург", 1852478, 810, 3),
          ("Мюнхен", 1488202, 1158, 3),
          ("Кёльн", 1073096, 100, 3),
          ("Дюссельдорф", 645923, 1135, 3),
          ("Шанхай", 24870895, 99, 4),
          ("Чунцин", 32054159, 1929, 4),
          ("Гуанчжоу", 18676605, 862, 4),
          ("Гонконг", 7474200, 1841, 4),
          ("Нью-Йорк", 8467513, 1624, 6),
          ("Хьюстон", 2287047, 1836, 6),
          ("Лос-Анджелес", 3849297, 1781, 6),
          ("Чикаго", 2746388, 1795, 6),
          ("Филадельфия", 1584138, 1682, 6),
          ("Роттердам", 631155, 1283, 11),
          ("Делфт", 102280, 1246, 11),
          ("Купертино", 58300, 1955, 6),
          ("Булонь-Бийанкур", 110300, 1400, 2),
          ("Штутгарт", 630305, 200, 3)
        ]

import sqlite3 as sq



with sq.connect("data_base.db") as con:
    cur = con.cursor()

    cur.execute("""DROP TABLE IF EXISTS cities""")
    cur.execute("""CREATE TABLE IF NOT EXISTS cities (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL,
    population INTEGER,
    founded INTEGER,
    country_id INTEGER
    )""")

    cur.executemany("INSERT INTO cities (name, population, founded, country_id) VALUES(?,?,?,?)", cities)



